Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes.IsFixed Property
 Defines whether the object is using fixed or free placing. If set to true, it means that fixed placing is enabled, and the object will not be rearranged in the drawing automatically. If set to false, then free placing is enabled, and the object will be placed in the most appropriate location near the original location.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsFixed { get; set; }
Public Property IsFixed As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PlacingAttributes Class
Tekla.Structures.Drawing Namespace